app/Http/Controllers/Web/Frontend/PaymentSystemController.php

select * from `w_payment_systems` where `type` = 'qiwi_rub' and `operation` = '2' and `active` = '1' limit 1
---
    public function addTask(Request $request)
    {
        if (!Auth::check()) {
            return response()->json(array('error' => 'Пожалуйста авторизуйтесь'), 403);
        }

        $request->validate([
            'operation' => 'required|int',
            'amount' => 'required',
            'type' => 'required|string',
            'account' => 'required|string',
        ]);

        $amount = $request->get('amount');
        if (!is_numeric($amount)) {
            return response()->json(array('error' => 'Сумма должна быть числом'), 422);
        }

        $amount = str_replace(',', '.', trim($amount));
        $amount = number_format(floatval($amount), 2, '.', '');

        /** @var PaymentSystem|null $paymentSystem */
        $paymentSystem = PaymentSystem::where('type', $request->get('type'))
            ->where('operation', $request->get('operation'))
            ->where('active', 1)
            ->first();

insert into `w_payment_tasks` (`user_id`, `payment_system_id`, `amount`, `account`, `updated_at`, `created_at`) values ('29', '7', '3242.00', '1234123413', '2020-04-14 17:06:57', '2020-04-14 17:06:57')
---
        $paymentTask->payment_system_id = $paymentSystem->id;
        $paymentTask->amount = $amount;
        $paymentTask->account = $request->get('account');
        $paymentTask->save();