app/Http/Controllers/Web/Frontend/ProfileController.php

select * from `w_payment_systems` where `type` = 'free_kassa' limit 1
---
        } elseif ($request->system === 'free-kassa') {

            /** @var PaymentSystem $paymentSystem */
            $paymentSystem = PaymentSystem::where('type', PaymentSystem::TYPE_FREE_KASSA)->first();