app/Repositories/Country/EloquentCountry.php

select `name`, `id` from `w_countries` order by `name` asc
---
    public function lists($column = 'name', $key = 'id')
    {
        return Country::orderBy('name')->pluck($column, $key);