app/Http/Controllers/Web/Backend/PaymentSystemController.php

    public function freeKassa()
    {
        /** @var PaymentSystem $paymentSystem */
        $paymentSystem = PaymentSystem::where('type', PaymentSystem::TYPE_FREE_KASSA)->first();
---
select * from `w_payment_systems` where `type` = 'free_kassa' limit 1

    public function giveMoneySettings()
    {
        $paymentSystems = PaymentSystem::where('operation', PaymentSystem::OPERATION_GIVE_MONEY)->get();
---
select * from `w_payment_systems` where `operation` = '2'

    public function update(Request $request)
    {
        $validationRules = [
            'operation' => 'required|int',
            'active' => 'bool',
            'type' => 'required|string',
            'min_amount' => 'required|int|min:1',
            'max_amount' => 'required|int|min:1',
        ];

        if (PaymentSystem::TYPE_FREE_KASSA === $request->get('type')) {
            $validationRules = array_merge($validationRules, [
                'config.merchant_url' => [
                    'required',
                    'string',
                    'min:33',
                    'max:255',
                    'regex:/^(https?:\/\/)?([\da-z\.-]+)\.([a-z\.]{2,6})([\/\w \.-]*)*\/?$/',
                ],
                'config.merchant_id' => 'required|int',
                'config.secret_key_1' => 'required|string',
                'config.secret_key_2' => 'required|string',
            ]);
        }

        $request->validate($validationRules);

        /** @var PaymentSystem $paymentSystem */
        $paymentSystem = PaymentSystem::where('type', $request->get('type'))->first();
---
select * from `w_payment_systems` where `type` = 'webmoney' limit 1

            $paymentSystem->type = $request->get('type');
        }

        $paymentSystem->fill($request->all())->save();
---
update `w_payment_systems` set `active` = '1', `updated_at` = '2020-04-14 17:46:11' where `id` = '5'