app/Http/Controllers/Web/Backend/PaymentTaskController.php

select * from `w_payment_tasks` limit 10 offset 0
select * from `w_users` where `w_users`.`id` in ('29', '30', '32', '34')
select count(*) as aggregate from `w_payment_tasks`
---
    public function giveMoneyTasks()
    {
        $paymentTasks = PaymentTask::with(['user', 'system'])->paginate(10);

select * from `w_payment_tasks` where `w_payment_tasks`.`id` = '9' limit 1
update `w_payment_tasks` set `status` = '2', `updated_at` = '2020-04-15 12:43:51' where `id` = '9'
---
    public function update(Request $request)
    {
        $request->validate([
            'id' => 'required|int',
            'status' => 'int|in:' . implode(',', [PaymentTask::STATUS_ACTIVE, PaymentTask::STATUS_COMPLETED]),
        ]);

        /** @var PaymentTask $paymentSystem */
        $paymentTask = PaymentTask::find($request->get('id'));
        if ($paymentTask === null) {
            return response()->json(array('error' => 'Error'), 422);
        }

        $paymentTask->fill($request->only('status'))->save();