app/Repositories/User/EloquentUser.php

update `w_users` set `last_login` = '2020-04-15 16:39:13', `updated_at` = '2020-04-15 16:39:13' where `id` = '14'
---
    public function update($id, array $data)
    {
        if (isset($data['country_id']) && $data['country_id'] == 0) {
            $data['country_id'] = null;
        }

        $user = $this->find($id);

        $user->update($data);

delete from `w_users` where `id` = '31'
---
    public function delete($id)
    {
        $user = $this->find($id);

        $this->avatarManager->deleteAvatarIfUploaded($user);

        return $user->delete();

select count(*) as aggregate from `w_users` where `created_at` between '2020-04-01 00:00:00' and '2020-04-15 16:03:30'
---
    public function newUsersCount()
    {
        return User::whereBetween('created_at', [Carbon::now()->firstOfMonth(), Carbon::now()])
            ->count();

select count(*) as aggregate from `w_users` where `status` = 'Banned'
---
    public function countByStatus($status)
    {
        return User::where('status', $status)->count();

select * from `w_users` order by `created_at` desc limit 6
---
    public function latest($count = 20)
    {
        return User::orderBy('created_at', 'DESC')
            ->limit($count)
            ->get();

select `created_at` from `w_users` where `created_at` between '2019-04-01 00:00:00' and '2020-04-30 23:59:59' order by `created_at` asc
---
    public function countOfNewUsersPerMonth(Carbon $from, Carbon $to)
    {
        $result = User::whereBetween('created_at', [$from, $to])
            ->orderBy('created_at')
            ->get(['created_at'])
            ->groupBy(function ($user) {
                return $user->created_at->format("Y_n");
            });

select * from `w_roles` where `name` = 'Admin' limit 1
---
    public function getUsersWithRole($roleName)
    {
        return Role::where('name', $roleName)
            ->first()
            ->users;

select * from `w_social_logins` where `user_id` = '36'
---
    public function getUserSocialLogins($userId)
    {
        return DB::table('social_logins')
            ->where('user_id', $userId)
            ->get();